package lectures.week3fp

object FunctionsFP extends App{
  // ===================================Функции, Функции высшего порядка==============================
  //Чистая функция(pure function) - это когда
  //
  //результат работы функции зависит только от того, что она получает на вход, и описанного внутри нее алгоритма. А значит, сколько бы раз такая функция ни была вызвана, например, для параметра х - результат ее работы будет неизменным
  //нет ни чтения, ни записи в файл или любого другого взаимодействия с внешним источником данных (файлом, базой данных, UI)


}
